Repository: Lpu8er/mf-discord
Catalog: translations/messages.*.xlf
Languages: fr

# credit_cubo
source: Cubo credit
fr: Crédit cubo

# ready
source: Bot loaded and ready
fr: Vous pouvez couper le Walking Chicken, je suis de retour !

source: head
fr: face

source: tail
fr: pile

# cmd_unimplemented_error
source: Unimplemented command `%cmd%`
fr: Commande non-implémentée `%cmd%`

# cmd_unrecognized_error
source: Unrecognized command `%cmd%`
fr: Commande non-reconnue `%cmd%` *(soon -1 PA)*

# unknown_error
source: An error occured, please retry later
fr: Une erreur est survenue. Merci de réessayer ultérieurement.

# invalid_code_error
source: Invalid code (error type %err%)
fr: Code invalide (erreur %err%)

# cmd_hello_help
source: just say hello
fr: dit simplement bonsoir

# cmd_hello_exec
source: Hello World
fr: Bonsoir

# cmd_help_help
source: give some help about `%cmd%` command
fr: affiche une aide à propos de la commande `%cmd%`

# cmd_help_exec
source: Available commands : %list% (use `%cmd%` to have more information about a command)
fr: Commandes disponibles : %list% (utilisez `%cmd%` pour avoir plus d'informations à propos d'une commande)

# cmd_kill_exec
source: Received disconnection order...
fr: Réception demande d'arrêt...

# cmd_link_help_first
source: `%cmd%` link your discord account with your Minefield account.
fr: `%cmd%` lie votre compte Discord à votre compte Minefield

# cmd_link_help_sec
source: Please note that you have to go on the website to generate the `%code%` to enter there.
fr: Veuillez notez que vous devez aller sur le site web pour générer le `%code%` à saisir.

# cmd_link_only_dm
source: This command works only when sent by a DM to the bot.
fr: Cette commande ne fonctionne qu'envoyée en privé au bot.

# link_code_nuked
source: Therefore, we nuked that code from orbit. Please visit the website again in order to get a new code.
fr: Du coup, nous avons annihilé (carrément) le code depuis la basse orbite. Merci de visiter à nouveau le site web pour obtenir un nouveau code.

# link_progress
source: User found ! Linking...
fr: Utilisateur trouvé ! Liaison...

# link_done
source: Linked and setup complete !
fr: Liaison et configuration effectuées !

# cmd_me_help
source: display some information about your account, if linked (works only in DM)
fr: affiche certaines informations à propos de votre compte, s'il est lié (fonctionne uniquement en message privé)

# cmd_me_exec_discorduser
source: Discord user
fr: Utilisateur Discord

# cmd_me_exec_notlinked
source: Not linked (yet ?)
fr: Pas (encore ?) lié

# cmd_me_exec_linkedto
source: Linked to %usr%
fr: Lié à %usr%

# cmd_me_exec_moneytrack
source: Income/outcome tracking
fr: Accès à votre suivi commerçant

# cmd_ticket_help
source: display your current ticket status (works only in DM)
fr: affiche la progression de votre ticket en cours (fonctionne uniquement par MP au bot)

# cmd_ticket_exec_none
source: No open ticket
fr: Aucun ticket ouvert ou tous tickets résolus

# cmd_ticket_exec_found
source: Open ticket found
fr: Ticket ouvert localisé

# cmd_die_help
source: throws a die
fr: lance un dé

# cmd_die_help_one
source: throws %arg% 6-faces dice
fr: lance %arg% dé(s)

# cmd_die_help_two
source: throws %arg% %sec%-faces dice
fr: lance %arg% dé(s) à %sec% faces

# cmd_ht_help_one
source: throws a coin
fr: lance une pièce

# cmd_ht_help_two
source: throws %arg% coins
fr: lance %arg% pièces

# cmd_ht_help_toss
source: %h% = head | %t% = tail
fr: %t% = pile | %h% = face

# cmd_head_help
source: throws a coin, success only on head
fr: lance une pièce, réussite uniquement sur face

# cmd_tail_help
source: throws a coin, success only on tail
fr: lance une pièce, réussite uniquement sur pile

# cmd_link_exec_names
source: Checking names...
fr: Vérification de noms...

# cmd_link_exec_clears
source: Clearing roles...
fr: Nettoyage des rôles...

# cmd_link_exec_addbase
source: Adding base role...
fr: Ajout du rôle de base...

# cmd_link_exec_addspec
source: Adding role for rank %ranknb% ...
fr: Ajout du rôle spécifique %ranknb% ...

# cmd_link_exec_addjob
source: Adding role for job %jobnb% ...
fr: Ajout du rôle spécifique %jobnb% ...

# cmd_link_exec_addtrader
source: Adding trader role...
fr: Ajout du rôle commerce

# cmd_goodbye_exec
source: %u% has left...
fr: %u% est parti...

# cmd_link_exec_addflavor
source: Adding role for flavor %flavornb% ...
fr: Ajout du rôle spécifique %flavornb% ...

# cmd_link_exec_addflavor
source: Adding base role for flavored ...
fr: Ajout du rôle scribe ...
